GF-Silva/MusicPlayer/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Bluetooth stack used by this project (A2DP source + AVRCP CT/TG)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_AVRCP_ENABLED=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Keep controller in classic mode to reduce memory pressure
# CONFIG_BTDM_CTRL_MODE_BLE_ONLY is not set
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
# CONFIG_BTDM_CTRL_MODE_BTDM is not set

# BLE is not used by this player
# CONFIG_BT_BLE_ENABLED is not set

# WiFi AP is used only for a small config page; keep WiFi code out of IRAM
# so the BT + WiFi-capable firmware fits on ESP32.
# CONFIG_ESP_WIFI_IRAM_OPT is not set
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set

# Deep sleep wakeup button uses internal pull-ups on RTC IO
CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS=y

# FATFS long filename support avoids filename truncation on SD
# CONFIG_FATFS_LFN_NONE is not set
# CONFIG_FATFS_LFN_HEAP is not set
CONFIG_FATFS_LFN_STACK=y

# MusicPlayer defaults
CONFIG_MUSICPLAYER_TARGET_DEVICE_NAME="TWS"
CONFIG_MUSICPLAYER_TARGET_MAC_0=0x41
CONFIG_MUSICPLAYER_TARGET_MAC_1=0x42
CONFIG_MUSICPLAYER_TARGET_MAC_2=0x78
CONFIG_MUSICPLAYER_TARGET_MAC_3=0xA4
CONFIG_MUSICPLAYER_TARGET_MAC_4=0x06
CONFIG_MUSICPLAYER_TARGET_MAC_5=0x97
CONFIG_MUSICPLAYER_DISCOVERY_TIMEOUT_SEC=12
CONFIG_MUSICPLAYER_BT_CONNECTING_STUCK_MS=90000
CONFIG_MUSICPLAYER_A2DP_OPEN_FAIL_REDISCOVERY_THRESHOLD=3
CONFIG_MUSICPLAYER_PIN_SD_MISO=19
CONFIG_MUSICPLAYER_PIN_SD_MOSI=23
CONFIG_MUSICPLAYER_PIN_SD_CLK=18
CONFIG_MUSICPLAYER_PIN_SD_CS=4
CONFIG_MUSICPLAYER_PIN_POWER_WAKE=33
CONFIG_MUSICPLAYER_PIN_STATUS_LED=2
CONFIG_MUSICPLAYER_LED_ACTIVE_HIGH=y
CONFIG_MUSICPLAYER_MOUNT_POINT="/sdcard"
CONFIG_MUSICPLAYER_WIFI_AP_SSID="ESP32-MusicPlayer"
CONFIG_MUSICPLAYER_WIFI_AP_PASSWORD="music1234"
CONFIG_MUSICPLAYER_WIFI_AP_CHANNEL=6
CONFIG_MUSICPLAYER_WIFI_AP_MAX_CONN=2

# Use the project's larger single-app partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

CONFIG_MUSICPLAYER_DEFAULT_VOLUME=30
CONFIG_MUSICPLAYER_VOLUME_STEP=5
CONFIG_MUSICPLAYER_DEBOUNCE_MS=50
CONFIG_MUSICPLAYER_DOUBLE_CLICK_INTERVAL_MS=300
CONFIG_MUSICPLAYER_LONG_CLICK_THRESHOLD_MS=400
CONFIG_MUSICPLAYER_POWER_HOLD_MS=2000
CONFIG_MUSICPLAYER_PWR_RELEASE_WAIT_MS=5000
CONFIG_MUSICPLAYER_AUTO_SLEEP_IDLE_MS=60000
CONFIG_MUSICPLAYER_MP3_INPUT_BUFFER_SIZE=16384
CONFIG_MUSICPLAYER_PCM_OUTPUT_BUFFER_SIZE=4608
CONFIG_MUSICPLAYER_STREAM_BUFFER_SIZE=32278
CONFIG_MUSICPLAYER_STREAM_LOW_WATERMARK_PCT=30
CONFIG_MUSICPLAYER_STREAM_HIGH_WATERMARK_PCT=60
CONFIG_MUSICPLAYER_MP3_READ_MIN=1024
CONFIG_MUSICPLAYER_MP3_READ_MAX=16384
CONFIG_MUSICPLAYER_MP3_CRITICAL_BYTES=4096
CONFIG_MUSICPLAYER_MP3_NO_SYNC_DROP_BYTES=512
CONFIG_MUSICPLAYER_PREBUFFER_FRAMES=10
CONFIG_MUSICPLAYER_DECODE_STALL_RECOVERY_MS=15000
